{
  "backend/main.mo": "Main backend actor implementing a product management system with CRUD operations for products (add, get, update, delete) and includes blob storage mixin for handling product images.",
  "feature_evidence.json": "Feature evidence report documenting the implementation of replacing placeholder logos with the Barebarbells logo across Navigation, Hero, and Footer components.",
  "frontend-file-summaries.txt": "Comprehensive summaries of all frontend files including components, pages, hooks, and configuration files for the Barebarbells e-commerce application.",
  "frontend/index.css": "Global CSS file defining Tailwind base styles with OKLCH color system variables for light and dark themes, including custom color tokens for background, foreground, borders, and UI elements.",
  "frontend/index.html": "HTML entry point for the Barebarbells application with root div and module script reference to main.tsx.",
  "frontend/src/App.tsx": "Root application component setting up TanStack Router with Layout wrapper, CartProvider context, and route configuration including Navigation, Footer, and CartPanel components.",
  "frontend/src/components/CartPanel.tsx": "Sliding cart panel component with item management (add/remove/update quantity), checkout functionality, overlay backdrop, and formatted price display with empty state handling.",
  "frontend/src/components/ContactForm.tsx": "Contact form component with validation, inquiry type selection, animated success state with checkmark icon, and scroll animation integration using custom hook.",
  "frontend/src/components/FAQAccordion.tsx": "Accordion component displaying 8 frequently asked questions about products, shipping, returns, and care instructions with gradient styling and scroll animations.",
  "frontend/src/components/FeaturesBentoGrid.tsx": "Displays a bento-grid layout of six product features (Premium Materials, Built to Last, Maximum Mobility, Bold Designs, Performance First, Champion Quality) with icons, descriptions, and optional background images, using scroll animations.",
  "frontend/src/components/Footer.tsx": "Renders the site footer with brand logo, social media links (Instagram, Facebook, Twitter), quick navigation links, contact information, and copyright notice with scroll-to-section functionality.",
  "frontend/src/components/Hero.tsx": "Main hero section component featuring the Barebarbells logo with glow effects, product description, CTA buttons (Shop Now, Learn More), and a product showcase image with floating product cards.",
  "frontend/src/components/Navigation.tsx": "Sticky navigation header with logo, desktop/mobile menu navigation, shopping cart button with item count badge, and smooth scroll-to-section functionality.",
  "frontend/src/components/PricingTable.tsx": "Displays three pricing tiers (Single Tee, 3-Pack Bundle, 5-Pack Bundle) with features, savings, and add-to-cart functionality, plus a toggle for subscription view (coming soon).",
  "frontend/src/components/ProductCard.tsx": "File appears to be empty or contains only whitespace.",
  "frontend/src/components/TestimonialsCarousel.tsx": "A carousel component displaying customer testimonials with 5-star ratings, auto-rotation every 5 seconds, and manual navigation buttons. Uses scroll animations and displays quotes from athletes about Barebarbells athletic wear.",
  "frontend/src/contexts/CartContext.tsx": "React context providing shopping cart functionality with add/remove/update operations, session storage persistence, and cart drawer toggle state. Exports CartProvider and useCart hook for managing cart items and totals.",
  "frontend/src/hooks/useActor.ts": "Custom hook that creates and manages an ICP backend actor instance based on Internet Identity authentication state. Automatically invalidates and refetches dependent queries when the actor changes.",
  "frontend/src/hooks/useInternetIdentity.ts": "Provides Internet Identity authentication context and hooks for ICP login/logout functionality. Includes AuthClient creation, identity persistence, and status management with configurable options.",
  "frontend/src/hooks/useQueries.ts": "Defines React Query hooks for fetching product data from the backend actor. Includes useGetAllProducts and useGetProduct queries that depend on actor availability.",
  "frontend/src/hooks/useScrollAnimation.ts": "Custom hook using IntersectionObserver to trigger animations when elements scroll into view. Respects user's reduced motion preferences and unobserves after first trigger.",
  "frontend/src/index.css": "Global styles defining CSS custom properties for light/dark themes with athletic brand colors (strength, energy, power), gradient utilities, and shadow effects. Uses OKLCH color space and Bebas Neue/Inter fonts.",
  "frontend/src/main.tsx": "Application entry point that sets up React Query client and Internet Identity provider, then renders the App component into the root DOM element.",
  "frontend/src/pages/Home.tsx": "Home page component that composes Hero, Features, Testimonials, Pricing, FAQ, and Contact sections with scroll margin for anchor navigation.",
  "frontend/src/pages/Products.tsx": "Empty products page component with no implementation.",
  "frontend/tailwind.config.js": "Tailwind CSS configuration extending default theme with custom OKLCH colors, athletic brand palette (strength/energy/power), custom fonts (Bebas Neue/Inter), border radius variables, and animation keyframes.",
  "project_state.json": "Project state file for Barebarbells e-commerce website tracking the integration of the brand logo (BB symbol with barbell and tagline) throughout the site. Currently at version 3 with one completed feature for replacing placeholder logos with the actual brand logo image."
}